app/controllers/incidents_controller.rb

 def show
  @incident = Incident.find(params[:id])
---
SELECT "incidents".* FROM "incidents" WHERE (incidents.latitude IS NOT NULL AND incidents.longitude IS NOT NULL) ORDER BY "incidents"."created_at" DESC

  def create
    @incident = Incident.new(incident_params)
    authorize @incident
   if @incident.save
---
INSERT INTO "incidents" ("title", "incident_type", "description", "time", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

   def update
    @incident = Incident.find(params[:id])
    @incident.update(params[:incident])
---
UPDATE "incidents" SET "updated_at" = $1 WHERE "incidents"."id" = $2  [["updated_at", "2022-06-05 04:27:31.945917"], ["id", 1]]